tsung.xml
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE tsung SYSTEM "/home/jenkins/tsung/tsung-1.0.dtd">
<tsung loglevel="debug">
   <clients>
      <client host="localhost" use_controller_vm="true" maxusers="200000" />
   </clients>
   <servers>
      <server host="speyside-ejabberd-test-1808990691.us-east-1.elb.amazonaws.com" port="5280" type="websocket" />
   </servers>
   <load duration="6" unit="minute">
      <arrivalphase phase="1" duration="1" unit="minute">
         <users arrivalrate="40" unit="second" />
      </arrivalphase>
      <arrivalphase phase="2" duration="5" unit="minute">
         <users arrivalrate="17" unit="second" />
      </arrivalphase>
   </load>
   <options>
      <option type="ts_jabber" name="userid_max" value="0" />
      <option type="ts_jabber" name="random_from_fileid" value='userdb'/>
      <option type="ts_jabber" name="offline_from_fileid" value='userdb'/>
      <option type="ts_jabber" name="fileid_delimiter" value=";"/>
      <option name="websocket_path" value="/websocket" />
      <option name="max_retries" value="5" />
      <option type="ts_jabber" name="global_number" value="1000000" />
      <option type="ts_jabber" name="domain" value="chat.staging.skillz.com" />
      <option type="ts_jabber" name="muc_service" value="conference.chat.staging.skillz.com" />
      <option name="file_server" id="userdb" value="/home/jenkins/workspace/TS/Gatling/TsungStagingtests/users.csv" />
   </options>

   <sessions>
      <session name="heavy-load" probability="10" type="ts_jabber">
         <setdynvars sourcetype="file" fileid="userdb" delimiter=";" order="iter">
            <var name="username" />
            <var name="password" />
         </setdynvars>
         <setdynvars sourcetype="random_string" length="20">
             <var name="resource_id" />
         </setdynvars>
         <request subst="true">
            <jabber type="connect" ack="no_ack">
               <xmpp_authenticate username="%%_username%%" passwd="%%_password%%" />
            </jabber>
         </request>
         <thinktime value="2" />
         <transaction name="authenticate">
            <request>
               <jabber type="auth_sasl" ack="local" />
            </request>
            <request>
               <jabber type="connect" ack="local" />
            </request>
            <request>
               <jabber type="auth_sasl_bind" ack="local" />
            </request>
            <request>
               <jabber type="auth_sasl_session" ack="local" resource="%%_resource_id%%" />
            </request>
         </transaction>
         <thinktime value="2" />
         <request>
            <jabber type="presence:initial" ack="no_ack" />
         </request>
         <setdynvars sourcetype="random_string" length="10">
            <var name="nick1" />
         </setdynvars>
         <transaction name="get_offline_message_count">
            <request>
               <jabber type="raw" ack="no_ack" data="&lt;iq   xmlns=&quot;jabber:client&quot; type=&quot;get&quot; id=&quot;8494d366-45ee-413c-af4f-2ba069e7a41f&quot;&gt;   &lt;query     xmlns=&quot;http://jabber.org/protocol/disco#info&quot; node=&quot;http://jabber.org/protocol/offline&quot;/&gt;   &lt;/iq&gt;" />
            </request>
         </transaction>
         <transaction name="roster_add">
           <request>
             <jabber type="iq:roster:add" ack="no_ack" destination="online"></jabber>
           </request>
           <request>
             <jabber type="presence:subscribe" ack="no_ack"/>
           </request>
         </transaction>

         <thinktime value="20" random="false" />

         <transaction name="join_room">
            <request subst="true">
               <jabber type="muc:join" ack="local" room="81" nick="%%_nick1%%" />
            </request>
         </transaction>
         <for from="1" to="6" incr="1" var="i">
            <transaction name="online_chat">
               <request>
                  <jabber type="muc:chat" ack="no_ack" size="16" room="81" />
               </request>
            </transaction>

            <thinktime value="30" random="true" />
         </for>
         <transaction name="get_offline_messages">
            <request>
               <jabber type="raw" ack="no_ack" data="&lt;iq   xmlns=&quot;jabber:client&quot; type=&quot;get&quot; id=&quot;8494d366-45ee-413c-af4f-2ba069e7a41f&quot;&gt;   &lt;query     xmlns=&quot;http://jabber.org/protocol/disco#items&quot; node=&quot;http://jabber.org/protocol/offline&quot;/&gt;   &lt;/iq&gt;" />
            </request>
         </transaction>

         <thinktime value="10" random="false" />

         <transaction name="presence_broadcast_all">
            <request>
               <jabber type="presence:broadcast" show="chat" status="Available to chat" ack="no_ack"/>
            </request>
         </transaction>
         <!-- keep alive -->
         <thinktime value="120" random="false" />
      </session>
      <session name="light-load" probability="90" type="ts_jabber">
         <setdynvars sourcetype="file" fileid="userdb" delimiter=";" order="iter">
            <var name="username" />
            <var name="password" />
         </setdynvars>
         <setdynvars sourcetype="random_string" length="20">
             <var name="resource_id" />
         </setdynvars>
         <request subst="true">
            <jabber type="connect" ack="no_ack">
               <xmpp_authenticate username="%%_username%%" passwd="%%_password%%" />
            </jabber>
         </request>
         <thinktime value="2" />
         <transaction name="authenticate">
            <request>
               <jabber type="auth_sasl" ack="local" />
            </request>
            <request>
               <jabber type="connect" ack="local" />
            </request>
            <request>
               <jabber type="auth_sasl_bind" ack="local" />
            </request>
            <request>
               <jabber type="auth_sasl_session" ack="local" resource="%%_resource_id%%" />
            </request>
         </transaction>
         <thinktime value="2" />
         <request>
            <jabber type="presence:initial" ack="no_ack" />
         </request>
         <setdynvars sourcetype="random_string" length="10">
            <var name="nick1" />
         </setdynvars>
         <setdynvars sourcetype="random_number" start="1" end="100">
            <var name="room1" />
         </setdynvars>
         <transaction name="join_room">
            <request subst="true">
               <jabber type="muc:join" ack="local" room="%%room1%%" nick="%%_nick1%%" />
            </request>
         </transaction>
            <for from="1" to="10" incr="1" var="i">
               <transaction name="online_chat">
                  <request subst="true">
                     <jabber type="muc:chat" ack="no_ack" size="16" room="81" />
                  </request>
               </transaction>

               <thinktime value="40" />

               <transaction name="get_offline_message_count">
                  <request>
                    <jabber type="raw" ack="no_ack" data="&lt;iq   xmlns=&quot;jabber:client&quot; type=&quot;get&quot; id=&quot;8494d366-45ee-413c-af4f-2ba069e7a41f&quot;&gt;   &lt;query     xmlns=&quot;http://jabber.org/protocol/disco#info&quot; node=&quot;http://jabber.org/protocol/offline&quot;/&gt;   &lt;/iq&gt;" />
                  </request>
               </transaction>

               <thinktime value="30" random="true" />
            </for>
         <!-- keep alive -->
         <thinktime value="120" random="false" />
      </session>
   </sessions>
</tsung>